Revit 2026 API

# ElectricalSystemPhaseLabel Property

---

The circuit phase label used in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PhaseLabel { get; }
```
```vb
Public ReadOnly Property PhaseLabel As String
	Get
```
```cpp
public:
property String^ PhaseLabel {
	String^ get ();
}
```
```fsharp
member PhaseLabel : string with get
```

#### Property Value

String

This property is used to retrieve the phase label of the Electrical System on a panel.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace